# Part - 1

### We can analyze data in pandas with:
<ol style='color:purple;font-weight:bold;' >
    <li>Series</li>           1-D
    <li>DataFrames</li>       2-D
</ol>

### Series
- 1-D
- Series is one dimensional(1-D) array defined in pandas that can be used to store any data type

In [ ]:
import pandas as pd
s=pd.Series(data,index=Index)

**Here, Data can be:**
- A **Scalar value** which can be integerValue, string
- A **Python Dictionary** which can be Key, Value pair
- A **Ndarray**

**Note:** **Index** by default is from 0, 1, 2, â€¦(n-1) where n is length of data.

<span style='color:#f94;'>Scalar value</span>

In [1]:
Data =[[1,5], 3, 4.6, 5, 'c', 2, 'a']
s=pd.Series(Data)
print(s)

0    [1, 5]
1         3
2       4.6
3         5
4         c
5         2
6         a
dtype: object

In [6]:
Data =[[1,5], 3, 4.6, 5, 'c', 2, 'a']
Index=['p','q','r','s','t','k','p']
s=pd.Series(data=Data,index=Index)
print(s)

p    [1, 5]
q         3
r       4.6
s         5
t         c
k         2
p         a
dtype: object

In [2]:
Data ={'Name':'Keshav','Class':'B.Tech VIth sem CSE','Roll':78,'RTU_ROLL':'17EJCCS080'}
s=pd.Series(Data)
print(s)

Name                     Keshav
Class       B.Tech VIth sem CSE
Roll                         78
RTU_ROLL             17EJCCS080
dtype: object

### DataFrames
- 2 D
- **DataFrames** is two-dimensional(2-D) data structure defined in pandas which consists of rows and columns.

In [ ]:
import pandas as pd
d=pd.DataFrame(Data)

**Here, Data can be:**
- One or more **dictionaries**
- One or more **Series**
- 2D-numpy **Ndarray**

In [12]:
# when data is dictionaries
dict1={'a':1,'b':2,'c':3}
dict2={'a':3,'b':1,'c':5,'d':7}
dict_={'first':dict1,'second':dict2}
d=pd.DataFrame(dict_)
print(d)

   first  second
a    1.0       3
b    2.0       1
c    3.0       5
d    NaN       7

In [18]:
# when data is Series
s1=pd.Series([1,2,3,4,6,7,9])
s2=pd.Series(['a','c','b','f','d'])
s3=pd.Series([[1,4,2],[3,5],[2,1,8,7]])
s={'first':s1,'second':s2,'third':s3}
d=pd.DataFrame(s)
print(d)

   first second         third
0      1      a     [1, 4, 2]
1      2      c        [3, 5]
2      3      b  [2, 1, 8, 7]
3      4      f           NaN
4      6      d           NaN
5      7    NaN           NaN
6      9    NaN           NaN

In [19]:
# When Data is 2D-numpy ndarray
d1=[[2,4,5],[3,5,7,2,1]]
d2=[[4,7,89],[1,5]]
Data={'First':d1,'Second':d2}
d=pd.DataFrame(Data)
print(d)

             First      Second
0        [2, 4, 5]  [4, 7, 89]
1  [3, 5, 7, 2, 1]      [1, 5]

# Part - 2

In [1]:
import pandas as pd
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]
cars_dict = { 'country':names, 'drives_right':dr, 'cars_per_cap':cpc }
cars = pd.DataFrame(cars_dict)
print(cars)

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

In [2]:
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']
cars.index=row_labels
print(cars)

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

In [7]:
data=pd.read_csv('Salaries.csv')
data.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [8]:
data.index=data['rank']
data.head()

      rank discipline  phd  service   sex  salary
rank
Prof  Prof          B   56       49  Male  186960
Prof  Prof          A   12        6  Male   93000
Prof  Prof          A   23       20  Male  110515
Prof  Prof          A   40       31  Male  131205
Prof  Prof          B   20       18  Male  104800

In [9]:
data=pd.read_csv('Salaries.csv',index_col=0)
data.head()

     discipline  phd  service   sex  salary
rank
Prof          B   56       49  Male  186960
Prof          A   12        6  Male   93000
Prof          A   23       20  Male  110515
Prof          A   40       31  Male  131205
Prof          B   20       18  Male  104800

# Part - 3